---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFilterType.IsAssociatedWithGlobalParameter
enum: Autodesk.Revit.DB.ScheduleFilterType
source: html/9b696f55-de40-8739-8cfb-decd51995cff.htm
---
# Autodesk.Revit.DB.ScheduleFilterType.IsAssociatedWithGlobalParameter

The field is associated with a specified global parameter of a compatible type